Reports/ФондЗатратНаПерсонал.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<Report>
		<Properties>
			<Name>ФондЗатратНаПерсонал</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОбщийОтчет</Name>
					<Type>
						<v8:Type>cfg:ReportObject.ОтчетСписокКроссТаблица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаОтчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтчетДиаграмма</Name>
					<Type>
						<v8:Type>cfg:ReportObject.ОтчетДиаграмма</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантОтображения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

InformationRegisters/РегламентированныйПроизводственныйКалендарь.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>РегламентированныйПроизводственныйКалендарь</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КалендарныеДни</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДня</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДнейПроизводственногоКалендаря</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ДатаКалендаря</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Год</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КадровыйПлан.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>КадровыйПлан</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПлановыеЕжемесячныеЗатраты</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОтраженияВУпрУчете</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СпособыОтраженияЗарплатыВУпрУчете</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/КурсыВалютДляРасчетовСПерсоналом.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.9">
	<InformationRegister>
		<Properties>
			<Name>КурсыВалютДляРасчетовСПерсоналом</Name>
			<Comment>(Общ)</Comment>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Курс</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Кратность</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Reports/ФондЗатратНаПерсонал/Ext/ObjectModule.bsl
#Если Клиент Тогда
////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Возвращает основную форму отчета, связанную с данным экземпляром отчета
//
// Параметры
//	Нет
//
Функция ПолучитьОсновнуюФорму() Экспорт
	
	ОснФорма = ПолучитьФорму();
	ОснФорма.ОбщийОтчет = ОбщийОтчет;
	ОснФорма.ЭтотОтчет = ЭтотОбъект;
	Возврат ОснФорма;
	
КонецФункции // ПолучитьОсновнуюФорму()

// Читает свойство Построитель отчета
//
// Параметры
//	Нет
//
Функция ПолучитьПостроительОтчета() Экспорт

	Возврат ОбщийОтчет.ПолучитьПостроительОтчета();

КонецФункции // ПолучитьПостроительОтчета()

// Составляет список возможных вариантов отображения
//
// Параметры: 
//  Отчет - объект отчета.
//
// Возвращаемое значение:
//  спиок значений.
//
Функция ПолучитьСписокВариантовОтображенияОтчета() Экспорт

	СписокВариантовОтображения = Новый СписокЗначений;
	СписокВариантовОтображения.Добавить("СводнаяТаблица",НСтр("ru='Сводная таблица';uk='Зведена таблиця'"));
	СписокВариантовОтображения.Добавить("Диаграмма",НСтр("ru='Диаграмма';uk='Діаграма'"));
	СписокВариантовОтображения.Добавить("Таблица",НСтр("ru='Таблица';uk='Таблиця'"));
	Возврат СписокВариантовОтображения

КонецФункции // ПолучитьСписокВариантовОтображенияОтчета

// Настраивает отчет по переданной структуре параметров
//
// Параметры:
//	Нет.
//
Процедура Настроить(Параметры) Экспорт

	ОбщийОтчет.Настроить(Параметры, ЭтотОбъект);

КонецПроцедуры

// Выполняет настройку отчета по умолчанию для заданного вида отчета
//
// Параметры: 
// 
Процедура ЗаполнитьНачальныеНастройки() Экспорт
	
	ОбщийОтчет.ИмяРегистра = "-";
	ОбщийОтчет.мНазваниеОтчета = НСтр("ru='Фонд затрат на персонал';uk='Фонд витрат на персонал'");
	ОтчетДиаграмма.ИмяРегистра = "-";
	ОтчетДиаграмма.мНазваниеОтчета = НСтр("ru='Фонд затрат на персонал';uk='Фонд витрат на персонал'");
	
	ПостроительОтчета = ОбщийОтчет.ПостроительОтчета;
	
	// Описание текста запроса:
	//
	//  1. выборка МесяцыОтчета
	//  из рег-ра РегламентированныйПроизводственныйКалендарь (который, как правило, заполнен)
	//  выбираем месяцы, входящие в период формирования отчета
	//  2. выборка ДатыПсевдоСрезов
	//  для каждой строки кадрового плана выбираем дату движения, непосредственно предшествующего
	//  началу очередного месяца из выборки МесяцыОтчета
	//  3. выборка ДвиженияКадровогоПлана
	//  состоит из движений рег-ра Кадровый план на даты из выборки ДатыПсевдоСрезов (фактически,
	//  это объединение срезов последних рег-ра на начало каждого месяца из выборки МесяцыОтчета)
	//  и всех движений рег-ра попавших в период формирования отчета
	//  4. выборка ПериодыПостоянстваКадровогоПлана
	//  для каждого движения из выборки ДвиженияКадровогоПлана определяем дату следующего движения,
	//  органичивая ее сверху концом месяца - определяем периоды существования строк кадрового плана 
	//  с неизменными параметрами
	//
	//  в итоговой выбоке для каждого периода существования строки кадрового плана (выборка ПериодыПостоянстваКадровогоПлана)
	//  рассчитываем его "вклад" в фонд затрат с учетом времени существования строки плана в течение 
	//  месяца (по календарным дням) с пересчетом в валюту отчета
	//
	
	ПостроительОтчета.Текст = "ВЫБРАТЬ
	              |	ВЫРАЗИТЬ((РАЗНОСТЬДАТ(ПериодыПостоянстваКадровогоПлана.ДатаПо, ПериодыПостоянстваКадровогоПлана.ДатаС, ДЕНЬ) + 1) / (РАЗНОСТЬДАТ(ПериодыПостоянстваКадровогоПлана.КонецМесяца, ПериодыПостоянстваКадровогоПлана.НачалоМесяца, ДЕНЬ) + 1) * ПериодыПостоянстваКадровогоПлана.Количество * ПериодыПостоянстваКадровогоПлана.ПлановыеЕжемесячныеЗатраты * ВЫБОР КОГДА ПериодыПостоянстваКадровогоПлана.Валюта = &ВалютаРегламентУчета ТОГДА 1 КОГДА КурсыВалют.Курс = NULL ТОГДА 0 ИНАЧЕ КурсыВалют.Курс / КурсыВалют.Кратность КОНЕЦ / &КроссКурсВалютыОтчета КАК ЧИСЛО(15, 2)) КАК ФондЗатрат
	              |		
				  |{ВЫБРАТЬ
	              |	ПериодыПостоянстваКадровогоПлана.Подразделение.* КАК Подразделение,
	              |	ПериодыПостоянстваКадровогоПлана.Должность.* КАК Должность,
	              |	ПериодыПостоянстваКадровогоПлана.Количество,
	              |	ПериодыПостоянстваКадровогоПлана.ПлановыеЕжемесячныеЗатраты,
	              |	ПериодыПостоянстваКадровогоПлана.НачалоМесяца КАК Месяц,
	              |	ПериодыПостоянстваКадровогоПлана.Валюта.* КАК Валюта
				  |}
	              |		
	              |ИЗ
	              |	(ВЫБРАТЬ
	              |		МАКСИМУМ(КурсыВалют.Период) КАК ДатаВалюты,
	              |		ДвиженияКадровогоПлана.ДатаС КАК ДатаС,
	              |		ДвиженияКадровогоПлана.Подразделение КАК Подразделение,
	              |		ДвиженияКадровогоПлана.Должность КАК Должность,
	              |		ДвиженияКадровогоПлана.Количество КАК Количество,
	              |		ДвиженияКадровогоПлана.ПлановыеЕжемесячныеЗатраты КАК ПлановыеЕжемесячныеЗатраты,
	              |		НАЧАЛОПЕРИОДА(ДвиженияКадровогоПлана.ДатаС, МЕСЯЦ) КАК НачалоМесяца,
	              |		КОНЕЦПЕРИОДА(ДвиженияКадровогоПлана.ДатаС, МЕСЯЦ) КАК КонецМесяца,
	              |		ВЫБОР КОГДА ДОБАВИТЬКДАТЕ(МАКСИМУМ(КадровыйПлан.Период), ДЕНЬ, -(1)) > КОНЕЦПЕРИОДА(ДвиженияКадровогоПлана.ДатаС, МЕСЯЦ) ИЛИ (МАКСИМУМ(КадровыйПлан.Период)) ЕСТЬ NULL  ТОГДА НАЧАЛОПЕРИОДА(КОНЕЦПЕРИОДА(ДвиженияКадровогоПлана.ДатаС, МЕСЯЦ), ДЕНЬ) ИНАЧЕ МАКСИМУМ(КадровыйПлан.Период) КОНЕЦ КАК ДатаПо,
	              |		ВЫБОР КОГДА (ДвиженияКадровогоПлана.Валюта) ЕСТЬ NULL  ИЛИ ДвиженияКадровогоПлана.Валюта = &ПустаяВалюта ТОГДА &УпрВалюта ИНАЧЕ ДвиженияКадровогоПлана.Валюта КОНЕЦ КАК Валюта
	              |	ИЗ
	              |		(ВЫБРАТЬ
	              |			ДатыПсевдоСрезов.Месяц КАК ДатаС,
	              |			ДатыПсевдоСрезов.Подразделение КАК Подразделение,
	              |			ДатыПсевдоСрезов.Должность КАК Должность,
	              |			КадровыйПлан.Количество КАК Количество,
	              |			КадровыйПлан.ПлановыеЕжемесячныеЗатраты КАК ПлановыеЕжемесячныеЗатраты,
	              |			КадровыйПлан.Валюта КАК Валюта
	              |		ИЗ
	              |			(ВЫБРАТЬ
	              |				МАКСИМУМ(КадровыйПлан.Период) КАК ДатаСреза,
	              |				МесяцыОтчета.Месяц КАК Месяц,
	              |				КадровыйПлан.Подразделение КАК Подразделение,
	              |				КадровыйПлан.Должность КАК Должность
	              |			ИЗ
	              |				(ВЫБРАТЬ РАЗЛИЧНЫЕ
	              |					НАЧАЛОПЕРИОДА(Календарь.ДатаКалендаря, МЕСЯЦ) КАК Месяц
	              |				ИЗ
	              |					РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК Календарь
	              |				
	              |				ГДЕ
	              |					Календарь.ДатаКалендаря МЕЖДУ &ДатаНач И &ДатаПо) КАК МесяцыОтчета
	              |					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадровыйПлан КАК КадровыйПлан
	              |					ПО МесяцыОтчета.Месяц > КадровыйПлан.Период
	              |			
				  |
				  |			{ГДЕ
	              |				КадровыйПлан.Подразделение.* КАК Подразделение,
	              |				КадровыйПлан.Должность.* КАК Должность,
	              |				КадровыйПлан.Количество,
	              |				КадровыйПлан.ПлановыеЕжемесячныеЗатраты,
	              |				КадровыйПлан.Валюта.* КАК Валюта
				  |			}
	              |			
	              |			СГРУППИРОВАТЬ ПО
	              |				МесяцыОтчета.Месяц,
	              |				КадровыйПлан.Подразделение,
	              |				КадровыйПлан.Должность) КАК ДатыПсевдоСрезов
	              |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадровыйПлан КАК КадровыйПлан
	              |				ПО ДатыПсевдоСрезов.Подразделение = КадровыйПлан.Подразделение И ДатыПсевдоСрезов.Должность = КадровыйПлан.Должность И ДатыПсевдоСрезов.ДатаСреза = КадровыйПлан.Период
	              |		
	              |		ОБЪЕДИНИТЬ
	              |		
	              |		ВЫБРАТЬ
	              |			КадровыйПлан.Период,
	              |			КадровыйПлан.Подразделение,
	              |			КадровыйПлан.Должность,
	              |			КадровыйПлан.Количество,
	              |			КадровыйПлан.ПлановыеЕжемесячныеЗатраты,
	              |			КадровыйПлан.Валюта
				  |		ИЗ
	              |			РегистрСведений.КадровыйПлан КАК КадровыйПлан
	              |		
	              |		ГДЕ
	              |			КадровыйПлан.Период МЕЖДУ &ДатаНач И &ДатаПо
				  |
				  |			{ГДЕ
	              |				КадровыйПлан.Подразделение.* КАК Подразделение,
	              |				КадровыйПлан.Должность.* КАК Должность,
	              |				КадровыйПлан.Количество,
	              |				КадровыйПлан.ПлановыеЕжемесячныеЗатраты,
	              |				КадровыйПлан.Валюта.* КАК Валюта
				  |			}
				  |
	              |			) КАК ДвиженияКадровогоПлана
	              |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КадровыйПлан КАК КадровыйПлан
	              |			ПО ДвиженияКадровогоПлана.Подразделение = КадровыйПлан.Подразделение И ДвиженияКадровогоПлана.Должность = КадровыйПлан.Должность И ДвиженияКадровогоПлана.ДатаС < КадровыйПлан.Период
	              |			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом КАК КурсыВалют
	              |			ПО ДвиженияКадровогоПлана.Валюта = КурсыВалют.Валюта И ДвиженияКадровогоПлана.ДатаС >= КурсыВалют.Период
	              |	
	              |	СГРУППИРОВАТЬ ПО
	              |		ДвиженияКадровогоПлана.ДатаС,
	              |		ДвиженияКадровогоПлана.Подразделение,
	              |		ДвиженияКадровогоПлана.Должность,
	              |		ДвиженияКадровогоПлана.Количество,
	              |		ДвиженияКадровогоПлана.ПлановыеЕжемесячныеЗатраты,
	              |		ВЫБОР КОГДА (ДвиженияКадровогоПлана.Валюта) ЕСТЬ NULL  ИЛИ ДвиженияКадровогоПлана.Валюта = &ПустаяВалюта ТОГДА &УпрВалюта ИНАЧЕ ДвиженияКадровогоПлана.Валюта КОНЕЦ) КАК ПериодыПостоянстваКадровогоПлана
	              |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалютДляРасчетовСПерсоналом КАК КурсыВалют
	              |		ПО ПериодыПостоянстваКадровогоПлана.Валюта = КурсыВалют.Валюта И ПериодыПостоянстваКадровогоПлана.ДатаВалюты = КурсыВалют.Период
	              |
	              |ИТОГИ СУММА(ФондЗатрат) ПО
	              |	ОБЩИЕ
				  |
				  |{ГДЕ
	              |	ПериодыПостоянстваКадровогоПлана.Подразделение.* КАК Подразделение,
	              |	ПериодыПостоянстваКадровогоПлана.Должность.* КАК Должность,
	              |	ПериодыПостоянстваКадровогоПлана.Количество,
	              |	ПериодыПостоянстваКадровогоПлана.ПлановыеЕжемесячныеЗатраты,
	              |	ПериодыПостоянстваКадровогоПлана.Валюта.* КАК Валюта
				  |}
				  |
				  |{УПОРЯДОЧИТЬ ПО
	              |	ПериодыПостоянстваКадровогоПлана.НачалоМесяца КАК Месяц,
	              |	ПериодыПостоянстваКадровогоПлана.Количество,
	              |	ПериодыПостоянстваКадровогоПлана.ПлановыеЕжемесячныеЗатраты,
	              |	ПериодыПостоянстваКадровогоПлана.Подразделение.* КАК Подразделение,
	              |	ПериодыПостоянстваКадровогоПлана.Должность.* КАК Должность,
	              |	ПериодыПостоянстваКадровогоПлана.Валюта.* КАК Валюта
				  |}
				  |
				  |{ИТОГИ ПО
	              |	ПериодыПостоянстваКадровогоПлана.НачалоМесяца КАК Месяц,
	              |	ПериодыПостоянстваКадровогоПлана.Подразделение.* КАК Подразделение,
	              |	ПериодыПостоянстваКадровогоПлана.Должность.* КАК Должность,
	              |	ПериодыПостоянстваКадровогоПлана.Валюта.* КАК Валюта
				  |}
				  |";
	
	
	// группировки по умолчанию
	ПостроительОтчета.ИзмеренияКолонки.Добавить("Месяц");
	ПостроительОтчета.ИзмеренияСтроки.Добавить("Подразделение");
	
	// список показателей и форматы их предстовления
	ОбщийОтчет.ЗаполнитьПоказатели("ФондЗатрат", НСтр("ru='Фонд затрат на персонал';uk='Фонд витрат на персонал'"), Истина, "ЧЦ=15; ЧДЦ=2");
	ОтчетДиаграмма.ЗаполнитьПоказатели("ФондЗатрат", НСтр("ru='Фонд затрат на персонал';uk='Фонд витрат на персонал'"), Истина, "ЧЦ=15; ЧДЦ=2");
	
	// представление полей
	СтруктураПредставлениеПолей = Новый Структура();
	СтруктураПредставлениеПолей.Вставить("ПлановыеЕжемесячныеЗатраты", НСтр("ru='Плановые ежемесячные затраты';uk='Планові щомісячні витрати'"));
	СтруктураПредставлениеПолей.Вставить("Количество", НСтр("ru='Плановое количество работников';uk='Планова кількість працівників'"));
	УправлениеОтчетами.ЗаполнитьПредставленияПолей(СтруктураПредставлениеПолей, ПостроительОтчета);
	
	// отборы по умолчанию
	МассивОтбора = Новый Массив;
	МассивОтбора.Добавить("Подразделение");
	МассивОтбора.Добавить("Должность");
	УправлениеОтчетами.ЗаполнитьОтбор(МассивОтбора, ПостроительОтчета);
	
	// очистка автозаполненных полей построителя
	ПостроительОтчета.ВыбранныеПоля.Очистить();
	
	// формат полей
	ОбщийОтчет.СтруктураФорматаПолей.Вставить("Месяц", "ДФ='ММММ yyyy'");
	
	// копирование настроек построителя
	ОтчетДиаграмма.ПостроительОтчета.Текст = ПостроительОтчета.Текст;
	ОтчетДиаграмма.ПостроительОтчета.УстановитьНастройки(ПостроительОтчета.ПолучитьНастройки());
	
	// параметры отчета
	ОбщийОтчет.ВыводитьИтогиПоВсемУровням = Истина;
	ОбщийОтчет.ВыводитьПоказателиВСтроку = Истина;
	ОбщийОтчет.мВыбиратьИмяРегистра = Ложь;
	ОбщийОтчет.мРежимВводаПериода = 0; // произвольный период
	ОбщийОтчет.мВыбиратьИспользованиеСвойств = Ложь;
	
	ОбщийОтчет.мСтруктураСвязиПоказателейИИзмерений.Вставить("ФондЗатрат", Новый Структура());
	
	ОтчетДиаграмма.мВыбиратьИмяРегистра = Ложь;
	ОтчетДиаграмма.мРежимВводаПериода = 0;
	ОтчетДиаграмма.мВыбиратьИспользованиеСвойств = Ложь;
	ОтчетДиаграмма.мСтруктураСвязиПоказателейИИзмерений.Вставить("ФондЗатрат", Новый Структура());
	
КонецПроцедуры

// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом,
//	ЕстьОшибки - флаг того, что при формировании произошли ошибки
//
//Процедура СформироватьОтчет(ДокументРезультат, ЕстьОшибки = Ложь) Экспорт
Процедура СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок = Ложь, ВысотаЗаголовка = 0, ТолькоЗаголовок = Ложь) Экспорт

	Если НЕ ЗначениеЗаполнено(ОбщийОтчет.ДатаНач) или НЕ ЗначениеЗаполнено(ОбщийОтчет.ДатаКон) Тогда
		Предупреждение(НСтр("ru='Не указаны даты, ограничивающие период!';uk='Не вказані дати, що обмежують період!'"));
		Возврат
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВалютаОтчета) Тогда
		Сообщить(НСтр("ru='Не указана валюта отчета!';uk='Не вказана валюта звіту!'"));
		Возврат;
	КонецЕсли; 
	
	// Кросс курс валюты отчета
	мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	Если ВалютаОтчета = мВалютаРегламентированногоУчета Тогда
		КроссКурсВалютыОтчета = 1;
	иначе	
		Структура = РегистрыСведений.КурсыВалютДляРасчетовСПерсоналом.ПолучитьПоследнее(ОбщийОтчет.ДатаКон, Новый Структура("Валюта", ВалютаОтчета));
		КроссКурсВалютыОтчета = ?(Структура.Кратность = 0, 0, Структура.Курс/Структура.Кратность);
	КонецЕсли; 
	
	Если КроссКурсВалютыОтчета = 0 Тогда
		Сообщить(НСтр("ru='На ';uk='На '") + Формат(ОбщийОтчет.ДатаКон,"ДФ=dd.MM.yyyy") + НСтр("ru=' не задан курс валюты ';uk=' не заданий курс валюти '") + ВалютаОтчета + НСтр("ru=' для расчетов с персоналом!';uk=' для розрахунків з персоналом!'"));
		Возврат;
	КонецЕсли; 
	
	Если Не РегламентированныйКалендарьЗаполнен(ОбщийОтчет.ДатаНач, ОбщийОтчет.ДатаКон, Истина) Тогда
		Возврат
	КонецЕсли;
	
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("КроссКурсВалютыОтчета", КроссКурсВалютыОтчета);
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ПустаяВалюта", Справочники.Валюты.ПустаяСсылка());
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("УпрВалюта", глЗначениеПеременной("ВалютаУправленческогоУчета"));
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ДатаПо", КонецДня(ОбщийОтчет.ДатаКон));
	ОбщийОтчет.ПостроительОтчета.Параметры.Вставить("ВалютаРегламентУчета", мВалютаРегламентированногоУчета);
	
	ОбщийОтчет.СформироватьОтчет(ДокументРезультат, ПоказыватьЗаголовок, ВысотаЗаголовка, ТолькоЗаголовок);

КонецПроцедуры

// Выполняет запрос и формирует диаграмму-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом,
//	ЕстьОшибки - флаг того, что при формировании произошли ошибки
//
//Процедура СформироватьОтчет(ДокументРезультат, ЕстьОшибки = Ложь) Экспорт
Процедура СформироватьДиаграмму(Диаграмма) Экспорт

	Если НЕ ЗначениеЗаполнено(ОбщийОтчет.ДатаНач) или НЕ ЗначениеЗаполнено(ОбщийОтчет.ДатаКон) Тогда
		Предупреждение(НСтр("ru='Не указаны даты, ограничивающие период!';uk='Не вказані дати, що обмежують період!'"));
		Возврат
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВалютаОтчета) Тогда
		Сообщить(НСтр("ru='Не указана валюта отчета!';uk='Не вказана валюта звіту!'"));
		Возврат;
	КонецЕсли; 
	
	// Кросс курс валюты отчета
	мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	Если ВалютаОтчета = мВалютаРегламентированногоУчета Тогда
		КроссКурсВалютыОтчета = 1;
	иначе	
		Структура = РегистрыСведений.КурсыВалютДляРасчетовСПерсоналом.ПолучитьПоследнее(ОбщийОтчет.ДатаКон, Новый Структура("Валюта", ВалютаОтчета));
		КроссКурсВалютыОтчета = ?(Структура.Кратность = 0, 0, Структура.Курс/Структура.Кратность);
	КонецЕсли; 
	
	Если КроссКурсВалютыОтчета = 0 Тогда
		Сообщить(НСтр("ru='На ';uk='На '") + Формат(ОбщийОтчет.ДатаКон,"ДФ=dd.MM.yyyy") + НСтр("ru=' не задан курс валюты ';uk=' не заданий курс валюти '") + ВалютаОтчета + НСтр("ru=' для расчетов с персоналом!';uk=' для розрахунків з персоналом!'"));
		Возврат;
	КонецЕсли; 
	
	Если Не РегламентированныйКалендарьЗаполнен(ОбщийОтчет.ДатаНач, ОбщийОтчет.ДатаКон, Истина) Тогда
		Возврат
	КонецЕсли;
	
	ОтчетДиаграмма.ПостроительОтчета.Параметры.Вставить("КроссКурсВалютыОтчета", КроссКурсВалютыОтчета);
	ОтчетДиаграмма.ПостроительОтчета.Параметры.Вставить("ПустаяВалюта", Справочники.Валюты.ПустаяСсылка());
	ОтчетДиаграмма.ПостроительОтчета.Параметры.Вставить("УпрВалюта", глЗначениеПеременной("ВалютаУправленческогоУчета"));
	ОтчетДиаграмма.ПостроительОтчета.Параметры.Вставить("ДатаПо", КонецДня(ОтчетДиаграмма.ДатаКон));
	ОтчетДиаграмма.ПостроительОтчета.Параметры.Вставить("ВалютаРегламентУчета", мВалютаРегламентированногоУчета);
	
	ОтчетДиаграмма.СформироватьОтчет(Диаграмма);

КонецПроцедуры

// Выполняет запрос и формирует табличный документ-результат отчета
// в соответствии с настройками, заданными значениями реквизитов отчета.
//
// Параметры:
//	ДокументРезультат - табличный документ, формируемый отчетом,
//	ЕстьОшибки - флаг того, что при формировании произошли ошибки
//
//Процедура СформироватьОтчет(ДокументРезультат, ЕстьОшибки = Ложь) Экспорт
Процедура СформироватьСводнуюТаблицу(ДокументРезультат) Экспорт

	Если НЕ ЗначениеЗаполнено(ОбщийОтчет.ДатаНач) или НЕ ЗначениеЗаполнено(ОбщийОтчет.ДатаКон) Тогда
		Предупреждение(НСтр("ru='Не указаны даты, ограничивающие период!';uk='Не вказані дати, що обмежують період!'"));
		Возврат
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(ВалютаОтчета) Тогда
		Сообщить(НСтр("ru='Не указана валюта отчета!';uk='Не вказана валюта звіту!'"));
		Возврат;
	КонецЕсли; 
	
	// Кросс курс валюты отчета
	мВалютаРегламентированногоУчета = глЗначениеПеременной("ВалютаРегламентированногоУчета");
	Если ВалютаОтчета = мВалютаРегламентированногоУчета Тогда
		КроссКурсВалютыОтчета = 1;
	иначе	
		Структура = РегистрыСведений.КурсыВалютДляРасчетовСПерсоналом.ПолучитьПоследнее(ОбщийОтчет.ДатаКон, Новый Структура("Валюта", ВалютаОтчета));
		КроссКурсВалютыОтчета = ?(Структура.Кратность = 0, 0, Структура.Курс/Структура.Кратность);
	КонецЕсли; 
	
	Если КроссКурсВалютыОтчета = 0 Тогда
		Сообщить(НСтр("ru='На ';uk='На '") + Формат(ОбщийОтчет.ДатаКон,"ДФ=dd.MM.yyyy") + НСтр("ru=' не задан курс валюты ';uk=' не заданий курс валюти '") + ВалютаОтчета + НСтр("ru=' для расчетов с персоналом!';uk=' для розрахунків з персоналом!'"));
		Возврат;
	КонецЕсли; 
	
	Если Не РегламентированныйКалендарьЗаполнен(ОбщийОтчет.ДатаНач, ОбщийОтчет.ДатаКон, Истина) Тогда
		Возврат
	КонецЕсли;
	
	ПостроительОтчета = ПолучитьПостроительОтчета();
	
	ПостроительОтчета.Параметры.Вставить("КроссКурсВалютыОтчета", КроссКурсВалютыОтчета);
	ПостроительОтчета.Параметры.Вставить("ПустаяВалюта", Справочники.Валюты.ПустаяСсылка());
	ПостроительОтчета.Параметры.Вставить("УпрВалюта", глЗначениеПеременной("ВалютаУправленческогоУчета"));
	ПостроительОтчета.Параметры.Вставить("ДатаПо", КонецДня(ОбщийОтчет.ДатаКон));
	ПостроительОтчета.Параметры.Вставить("ВалютаРегламентУчета", мВалютаРегламентированногоУчета);
	
	ПостроительОтчета.Параметры.Вставить("ДатаНач", ОбщийОтчет.ДатаНач);
	Если ОбщийОтчет.ДатаКон <> '00010101000000' Тогда
		Если ОбщийОтчет.мРежимВводаПериода = 1 Тогда
			ПостроительОтчета.Параметры.Вставить("ДатаКон", НачалоДня(ОбщийОтчет.ДатаКон + 60*60*24));
		Иначе
			ПостроительОтчета.Параметры.Вставить("ДатаКон", КонецДня(ОбщийОтчет.ДатаКон ));
		КонецЕсли;
	Иначе
		ПостроительОтчета.Параметры.Вставить("ДатаКон", '00010101000000');
	КонецЕсли;
	
	ПостроительОтчета.Выполнить();
	ДокументРезультат.ИсточникДанных = ПостроительОтчета.Результат;
	ОбновлятьОформлениеСводнойТаблицы = ДокументРезультат.Данные.Количество() = 0 и ДокументРезультат.Строки.Количество() = 0;
	Если ОбновлятьОформлениеСводнойТаблицы Тогда
		Для ИндексПоля = 0 По ДокументРезультат.Поля.Количество() - 1 Цикл
			ПолеТаблицы = ДокументРезультат.Поля[ИндексПоля];
			Если ПолеТаблицы.Ресурс Тогда
				ДокументРезультат.Данные.Добавить(ПолеТаблицы)
			Иначе
				ДокументРезультат.Строки.Добавить(ПолеТаблицы)
			КонецЕсли;
		КонецЦикла;
		ДокументРезультат.Колонки.Добавить(ДокументРезультат.Данные);
	КонецЕсли;
	
	
КонецПроцедуры


// Возвращает форму настройки 
//
// Параметры:
//	Нет.
//
// Возвращаемое значение:
//	
//
Функция ПолучитьФормуНастройки() Экспорт
	
	ФормаНастройки = ОбщийОтчет.ПолучитьФорму("ФормаНастройка");
	Возврат ФормаНастройки;
	
КонецФункции // ПолучитьФормуНастройки()

// Процедура обработки расшифровки
//
// Параметры:
//	Нет.
//
Процедура ОбработкаРасшифровки(РасшифровкаСтроки, ПолеТД, ВысотаЗаголовка, СтандартнаяОбработка) Экспорт
	
	// Добавление расшифровки из колонки
	Если ТипЗнч(РасшифровкаСтроки) = Тип("Структура") Тогда
		
		// Расшифровка колонки находится в заголовке колонки
		РасшифровкаКолонки = ПолеТД.Область(ВысотаЗаголовка+2, ПолеТД.ТекущаяОбласть.Лево).Расшифровка;

		Расшифровка = Новый Структура;

		Для каждого Элемент Из РасшифровкаСтроки Цикл
			Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
		КонецЦикла;

		Если ТипЗнч(РасшифровкаКолонки) = Тип("Структура") Тогда

			Для каждого Элемент Из РасшифровкаКолонки Цикл
				Расшифровка.Вставить(Элемент.Ключ, Элемент.Значение);
			КонецЦикла;

		КонецЕсли; 

		ОбщийОтчет.ОбработкаРасшифровкиСтандартногоОтчета(Расшифровка, СтандартнаяОбработка, ЭтотОбъект);

	КонецЕсли;
	
КонецПроцедуры // ОбработкаРасшифровки()

// Формирует структуру, в которую складываются настройки
//
Функция СформироватьСтруктуруДляСохраненияНастроек(ПоказыватьЗаголовок) Экспорт
	
	СтруктураНастроек = Новый Структура;
	
	ОбщийОтчет.СформироватьСтруктуруДляСохраненияНастроек(СтруктураНастроек, ПоказыватьЗаголовок);
	СтруктураНастроек.Вставить("ВалютаОтчета", ВалютаОтчета);
	
	Возврат СтруктураНастроек;
	
КонецФункции

// Заполняет настройки из структуры - кроме состояния панели "Отбор"
//
Процедура ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок, Отчет = Неопределено) Экспорт
	
	// Если отчет, вызвавший процедуру, не передан, то считаем, что ее вызвал этот отчет
	Если Отчет = Неопределено Тогда
		Отчет = ЭтотОбъект;
	КонецЕсли;

	ОбщийОтчет.ВосстановитьНастройкиИзСтруктуры(СохраненныеНастройки, ПоказыватьЗаголовок, Отчет);
	
КонецПроцедуры

Функция РегламентированныйКалендарьЗаполнен(ДатаНач, ДатаКон, ВыводитьСообщения = Ложь) 

	ТекстЛет = "ВЫБРАТЬ " + Символы.ПС + Символы.Таб + Формат(ДатаНач,"ДФ=yyyy") + " КАК Год";
	ТекущийГод = Год(ДатаНач) + 1;
	Пока ТекущийГод <= Год(ДатаКон) Цикл
	    ТекстЛет = ТекстЛет + Символы.ПС + Символы.Таб + "Объединить" + Символы.ПС + "ВЫБРАТЬ " + Символы.ПС + Символы.Таб + Формат(ТекущийГод,"ЧГ=0");
		ТекущийГод = ТекущийГод + 1;
	КонецЦикла;
	
	Запрос = Новый Запрос();
	
	ТекстЗапроса = 
		"ВЫБРАТЬ
		|	ГодыПериода.Год,
		|	ДатыКалендаря.КоличествоДней
		|ИЗ
		|	(" + ТекстЛет + ") КАК ГодыПериода
		|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			КОЛИЧЕСТВО(РАЗЛИЧНЫЕ РегламентированныйПроизводственныйКалендарь.ДатаКалендаря) КАК КоличествоДней,
		|			РегламентированныйПроизводственныйКалендарь.Год КАК Год
		|		ИЗ
		|			РегистрСведений.РегламентированныйПроизводственныйКалендарь КАК РегламентированныйПроизводственныйКалендарь
		|		
		|		ГДЕ
		|			РегламентированныйПроизводственныйКалендарь.ДатаКалендаря МЕЖДУ &ДатаС И &ДатаПо
		|		
		|		СГРУППИРОВАТЬ ПО
		|			РегламентированныйПроизводственныйКалендарь.Год) КАК ДатыКалендаря
		|		ПО ГодыПериода.Год = ДатыКалендаря.Год";
		
	Запрос.Текст = ТекстЗапроса;					   
	Запрос.УстановитьПараметр("ДатаПо", КонецДня(ДатаКон));
	Запрос.УстановитьПараметр("ДатаС", ДатаНач);
	Выборка = Запрос.Выполнить().Выбрать();
	КалендарьЗаполнен = Истина;
	Сообщение = НСтр("ru='Перед формированием отчета заполните ""Регламентированный производственный календарь"" за ';uk='Перед формуванням звіту заповніть ""Регламентований виробничий календар"" за '");
	Пока Выборка.Следующий() Цикл
		Если Выборка.КоличествоДней = Null Тогда
			Сообщение = Сообщение + ?(КалендарьЗаполнен,"",", ") + Формат(Выборка.Год,"ЧГ=0");
			КалендарьЗаполнен = Ложь;
		КонецЕсли;
	КонецЦикла;
	Если Не КалендарьЗаполнен и ВыводитьСообщения Тогда
		Сообщить(Сообщение + ?(Найти(Сообщение,",")=0,НСтр("ru=' год!';uk=' рік!'"),НСтр("ru=' годы!';uk=' роки!'")));
	КонецЕсли;
	
    Возврат КалендарьЗаполнен
	
КонецФункции // РегламентированныйКалендарьЗаполнен()

#КонецЕсли
